clean-code-3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>clean-code-3</title>
<!-- 2017-11-27 Mon 22:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Afaren" />
<link rel="stylesheet" type="text/css" href="css/site.css"/>
</head>
<body>
<div id="content">
<h1 class="title">clean-code-3</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">你是否应该读 Clean Code 这本书 (下)</a>
<ul>
<li><a href="#sec-1-1">前情提要</a></li>
<li><a href="#sec-1-2">悟性是不可靠的</a></li>
<li><a href="#sec-1-3">规范！规范！规范</a></li>
<li><a href="#sec-1-4">如何提高代码质量</a>
<ul>
<li><a href="#sec-1-4-1">老人的回答</a>
<ul>
<li><a href="#sec-1-4-1-1">熟读唐诗三百首,不会作诗也会吟</a></li>
</ul>
</li>
<li><a href="#sec-1-4-2">说了等于没说</a></li>
<li><a href="#sec-1-4-3">不具可操作性</a></li>
<li><a href="#sec-1-4-4">不分层</a></li>
</ul>
</li>
<li><a href="#sec-1-5">最后结论</a></li>
<li><a href="#sec-1-6">缺失的是习惯的培养</a></li>
<li><a href="#sec-1-7">先说结论</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">你是否应该读 Clean Code 这本书 (下)</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">前情提要</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在前两篇文章中，我们已经明确了 Clean Code 的目的是减少团队成员的沟通成
本，今天我将根据自身的经验讲述为什么怎样才能学习编写 Clean Code，这完全
是一家之谈，有不对之处，请不吝赐教。
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">悟性是不可靠的</h3>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">规范！规范！规范</h3>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">如何提高代码质量</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">老人的回答</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
大多数情况下，我拿着这个问题去问人，都会得到同样的回答：多读，多写。
</p>
</div>
<div id="outline-container-sec-1-4-1-1" class="outline-5">
<h5 id="sec-1-4-1-1">熟读唐诗三百首,不会作诗也会吟</h5>
<div class="outline-text-5" id="text-1-4-1-1">
<p>
多读，多读别人写的代码，好的代码
</p>


<p>
咋看之下，这个问题看起来很没有必要。如何能获得经验，那不就是勤加练习吗？
多写代码，多看别人写的好的代码。
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">说了等于没说</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
 从理论到实践，从常识到可操作行为，
做到了，所以有共鸣；没有共鸣，还没有做到或者不知道可以这么做；
</p>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">不具可操作性</h4>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">不分层</h4>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">最后结论</h3>
<div class="outline-text-3" id="text-1-5">
<p>
这本书适合作为检查清单
提前看，作用不大。因为没有遇到痛点，一般人都记不住规范。
</p>

<p>
用篮球来比喻
完全不会打篮球的人，看到高超的技巧，完全没有感受
乔丹
科比
菜鸟
神级选手
</p>

<p>
只有到了可理解区间，才能明白对方的强大
</p>

<p>
以前看不下去，感觉没有营养的书籍，到了某个层次，就会变成有营养了
</p>
</div>
</div>



<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">缺失的是习惯的培养</h3>
<div class="outline-text-3" id="text-1-6">
<p>
问题变成如何：如何编写可读性高的代码
应该从软件构建之道那个书上讲的，一个多次迭代的项目，才能看得出来，优秀编程实践的作用
只写一遍就结束，也没有人用的程序，得不到反馈。
而且事实上，新人没有足够的知识去判断程序写得好不好
但是，如果让他自己通过多次迭代去增进对代码的认识的话，可能是一个不错的方式
</p>

<p>
如果你自己一个人开发，那么就随便吧，怎么开心怎么来，大括号爱放哪儿放哪
儿，蛇地式还是驼峰式也随便选。
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">先说结论</h3>
<div class="outline-text-3" id="text-1-7">
<p>
经过很长时间的观察和思考，我得出的提高代码质量的方法就是：
</p>
<ul class="org-ul">
<li>首先搞明白团队里的高质量代码是什么样子的
</li>
<li>临摹
</li>
<li>融合
</li>
</ul>













<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">-rw-r&#x2013;r--</td>
<td class="right">1</td>
<td class="left">cfachen</td>
<td class="left">staff</td>
<td class="left">11K</td>
<td class="right">27</td>
<td class="left">Nov</td>
<td class="right">22:05</td>
<td class="left">clean-code-3.html</td>
</tr>

<tr>
<td class="left">drwxr-xr-x</td>
<td class="right">6</td>
<td class="left">cfachen</td>
<td class="left">staff</td>
<td class="left">204B</td>
<td class="right">27</td>
<td class="left">Nov</td>
<td class="right">22:04</td>
<td class="left">css</td>
</tr>

<tr>
<td class="left">drwxr-xr-x</td>
<td class="right">12</td>
<td class="left">cfachen</td>
<td class="left">staff</td>
<td class="left">408B</td>
<td class="right">27</td>
<td class="left">Nov</td>
<td class="right">22:19</td>
<td class="left">my-awesome-site</td>
</tr>

<tr>
<td class="left">-rw-r&#x2013;r--</td>
<td class="right">1</td>
<td class="left">cfachen</td>
<td class="left">staff</td>
<td class="left">6.8K</td>
<td class="right">27</td>
<td class="left">Nov</td>
<td class="right">22:05</td>
<td class="left">sitemap.html</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2017-11-27 Mon 22:33. Created by Afaren</p>

                           <script>
                             var _hmt = _hmt || [];
                             (function() {
                                      var hm = document.createElement("script");
                                      hm.src = "//hm.baidu.com/hm.js?yourkey";
                                      var s = document.getElementsByTagName("script")[0];
                                      s.parentNode.insertBefore(hm, s);
                                      })();
                           </script>

                           <div id="disqus_thread"></div>
                           <script type="text/javascript">
                           var disqus_shortname = 'yourshortname';
                           (function() {
                                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                                    })();
                           </script>

                           <script>
                             (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');
                             ga('create', 'yourkey', 'auto');
                             ga('send', 'pageview');
                             </script>
</div>
</body>
</html>